[Killed] LogicalOperator
classes.ts:15:9
   phone?: string;
 
   constructor(id: string, name: string, email: string, phone?: string) {
-    if (!id || !name) {
+    if (!id && !name) {
       throw new Error("El participante debe tener un id y un nombre.");
     }
killedBy: Participante debe lanzar un error si falta el id o el nombre
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El participante debe tener un id y un nombre."

Received function did not throw

[Killed] ConditionalExpression
classes.ts:15:9
   phone?: string;
 
   constructor(id: string, name: string, email: string, phone?: string) {
-    if (!id || !name) {
+    if (false) {
       throw new Error("El participante debe tener un id y un nombre.");
     }
killedBy: Participante debe lanzar un error si falta el id o el nombre
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El participante debe tener un id y un nombre."

Received function did not throw

[Killed] ConditionalExpression
classes.ts:18:9
     if (!id || !name) {
       throw new Error("El participante debe tener un id y un nombre.");
     }
-    if (!email) {
+    if (false) {
       throw new Error("El participante debe tener un correo electrónico.");
     }
killedBy: Participante debe lanzar un error si el correo electrónico está vacío
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El participante debe tener un correo electrónico."
Received message:   "Formato de correo electrónico inválido."

      83 |         } else {
      84 |           stryCov_9fa48("16");
    > 85 |           throw new Error(stryMutAct_9fa48("17") ? "" : (stryCov_9fa48("17"), "Formato de correo electrónico inválido."));

[Killed] BooleanLiteral
classes.ts:18:9
     if (!id || !name) {
       throw new Error("El participante debe tener un id y un nombre.");
     }
-    if (!email) {
+    if (email) {
       throw new Error("El participante debe tener un correo electrónico.");
     }
killedBy: Participante debe crear un participante con datos válidos
statusReason: Error: El participante debe tener un correo electrónico.

[Killed] ConditionalExpression
classes.ts:21:9
     if (!email) {
       throw new Error("El participante debe tener un correo electrónico.");
     }
-    if (!this.isValidEmail(email)) {
+    if (false) {
       throw new Error("Formato de correo electrónico inválido.");
     }
killedBy: Participante debe lanzar un error por un correo electrónico inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Formato de correo electrónico inválido."

Received function did not throw

[Killed] BooleanLiteral
classes.ts:21:9
     if (!email) {
       throw new Error("El participante debe tener un correo electrónico.");
     }
-    if (!this.isValidEmail(email)) {
+    if (this.isValidEmail(email)) {
       throw new Error("Formato de correo electrónico inválido.");
     }
killedBy: Participante debe crear un participante con datos válidos
statusReason: Error: Formato de correo electrónico inválido.

[Killed] Regex
classes.ts:32:24
   }
 
   private isValidEmail(email: string): boolean {
-    const emailRegex = /^[^@ ]+@[^@ ]+\.[^@ ]+$/;
+    const emailRegex = /^[^@ ]+@[^@ ]\.[^@ ]+$/;
     return emailRegex.test(email);
   }
killedBy: Participante debe crear un participante con datos válidos
statusReason: Error: Formato de correo electrónico inválido.

[Killed] Regex
classes.ts:32:24
   }
 
   private isValidEmail(email: string): boolean {
-    const emailRegex = /^[^@ ]+@[^@ ]+\.[^@ ]+$/;
+    const emailRegex = /^[^@ ]@[^@ ]+\.[^@ ]+$/;
     return emailRegex.test(email);
   }
killedBy: Participante debe crear un participante con datos válidos
statusReason: Error: Formato de correo electrónico inválido.

[Killed] BlockStatement
classes.ts:36:58
     return emailRegex.test(email);
   }
 
-  updateContactInfo(email: string, phone?: string): void {
-    if (!this.isValidEmail(email)) {
-      throw new Error("Formato de correo electrónico inválido.");
-    }
-    this.email = email;
-    this.phone = phone;
-  }
+  updateContactInfo(email: string, phone?: string): void {}
 
   getParticipantInfo(): IParticipant {
killedBy: Participante debe actualizar la información de contacto
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "email": "new.email@example.com",
+   "email": "john.doe@example.com",

[Killed] BooleanLiteral
classes.ts:37:9
   }
 
   updateContactInfo(email: string, phone?: string): void {
-    if (!this.isValidEmail(email)) {
+    if (this.isValidEmail(email)) {
       throw new Error("Formato de correo electrónico inválido.");
     }
killedBy: Participante debe actualizar la información de contacto
statusReason: Error: Formato de correo electrónico inválido.

[Killed] ConditionalExpression
classes.ts:37:9
   }
 
   updateContactInfo(email: string, phone?: string): void {
-    if (!this.isValidEmail(email)) {
+    if (false) {
       throw new Error("Formato de correo electrónico inválido.");
     }
killedBy: Participante debe lanzar un error al actualizar con un correo electrónico inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Formato de correo electrónico inválido."

Received function did not throw

[Killed] BlockStatement
classes.ts:59:17
   private board: BoardNumber[] = [];
   private participants: Map<string, IParticipant> = new Map();
 
-  constructor() {
-    this.initializeBoard();
-  }
+  constructor() {}
 
   private initializeBoard(): void {
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] BlockStatement
classes.ts:63:35
     this.initializeBoard();
   }
 
-  private initializeBoard(): void {
-    for (let i = 0; i < 100; i++) {
-      const number = i.toString().padStart(2, '0');
-      this.board.push({
-        number,
-        isOccupied: false,
-        participantId: null,
-      });
-    }
-  }
+  private initializeBoard(): void {}
 
   registerParticipant(participant: IParticipant): void {
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] BlockStatement
classes.ts:64:35
   }
 
   private initializeBoard(): void {
-    for (let i = 0; i < 100; i++) {
-      const number = i.toString().padStart(2, '0');
-      this.board.push({
-        number,
-        isOccupied: false,
-        participantId: null,
-      });
-    }
+    for (let i = 0; i < 100; i++) {}
   }
 
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] EqualityOperator
classes.ts:64:21
   }
 
   private initializeBoard(): void {
-    for (let i = 0; i < 100; i++) {
+    for (let i = 0; i >= 100; i++) {
       const number = i.toString().padStart(2, '0');
       this.board.push({
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] StringLiteral
classes.ts:65:47
 
   private initializeBoard(): void {
     for (let i = 0; i < 100; i++) {
-      const number = i.toString().padStart(2, '0');
+      const number = i.toString().padStart(2, "");
       this.board.push({
         number,
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: Número de tablero inválido.

[Killed] BooleanLiteral
classes.ts:68:21
       const number = i.toString().padStart(2, '0');
       this.board.push({
         number,
-        isOccupied: false,
+        isOccupied: true,
         participantId: null,
       });
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] BlockStatement
classes.ts:74:56
     }
   }
 
-  registerParticipant(participant: IParticipant): void {
-    if (this.participants.has(participant.id)) {
-      throw new Error('Participante con este ID ya registrado.');
-    }
-    this.participants.set(participant.id, participant);
-  }
+  registerParticipant(participant: IParticipant): void {}
 
   getParticipant(participantId: string): IParticipant | undefined {
killedBy: Tablero debe registrar un participante
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "john.smith@example.com", "id": "2", "name": "John Smith", "phone": undefined}
Received: undefined

[Killed] BlockStatement
classes.ts:75:48
   }
 
   registerParticipant(participant: IParticipant): void {
-    if (this.participants.has(participant.id)) {
-      throw new Error('Participante con este ID ya registrado.');
-    }
+    if (this.participants.has(participant.id)) {}
     this.participants.set(participant.id, participant);
   }
killedBy: Tablero debe lanzar un error si el participante ya está registrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Participante con este ID ya registrado."

Received function did not throw

[Killed] ConditionalExpression
classes.ts:75:9
   }
 
   registerParticipant(participant: IParticipant): void {
-    if (this.participants.has(participant.id)) {
+    if (false) {
       throw new Error('Participante con este ID ya registrado.');
     }
killedBy: Tablero debe lanzar un error si el participante ya está registrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Participante con este ID ya registrado."

Received function did not throw

[Killed] StringLiteral
classes.ts:76:23
 
   registerParticipant(participant: IParticipant): void {
     if (this.participants.has(participant.id)) {
-      throw new Error('Participante con este ID ya registrado.');
+      throw new Error("");
     }
     this.participants.set(participant.id, participant);
killedBy: Tablero debe lanzar un error si el participante ya está registrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Participante con este ID ya registrado."
Received message:   ""

      178 |         } else {
      179 |           stryCov_9fa48("49");
    > 180 |           throw new Error(stryMutAct_9fa48("50") ? "" : (stryCov_9fa48("50"), 'Participante con este ID ya registrado.'));

[Killed] BlockStatement
classes.ts:89:67
     return Array.from(this.participants.values());
   }
 
-  reserveNumber(participantId: string, boardNumber: string): void {
-    const participant = this.participants.get(participantId);
-    if (!participant) {
-      throw new Error('Participante no encontrado.');
-    }
-
-    const numberIndex = this.board.findIndex(n => n.number === boardNumber);
-    if (numberIndex === -1) {
-      throw new Error('Número de tablero inválido.');
-    }
-
-    if (this.board[numberIndex].isOccupied) {
-      throw new Error(`El número ${boardNumber} ya está ocupado.`);
-    }
-
-    this.board[numberIndex].isOccupied = true;
-    this.board[numberIndex].participantId = participantId;
-  }
+  reserveNumber(participantId: string, boardNumber: string): void {}
 
   freeNumber(boardNumber: string): void {
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
classes.ts:91:9
 
   reserveNumber(participantId: string, boardNumber: string): void {
     const participant = this.participants.get(participantId);
-    if (!participant) {
+    if (true) {
       throw new Error('Participante no encontrado.');
     }
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: Participante no encontrado.

[Killed] BooleanLiteral
classes.ts:91:9
 
   reserveNumber(participantId: string, boardNumber: string): void {
     const participant = this.participants.get(participantId);
-    if (!participant) {
+    if (participant) {
       throw new Error('Participante no encontrado.');
     }
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: Participante no encontrado.

[Killed] ArrowFunction
classes.ts:95:46
       throw new Error('Participante no encontrado.');
     }
 
-    const numberIndex = this.board.findIndex(n => n.number === boardNumber);
+    const numberIndex = this.board.findIndex(() => undefined);
     if (numberIndex === -1) {
       throw new Error('Número de tablero inválido.');
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: Número de tablero inválido.

[Killed] EqualityOperator
classes.ts:95:51
       throw new Error('Participante no encontrado.');
     }
 
-    const numberIndex = this.board.findIndex(n => n.number === boardNumber);
+    const numberIndex = this.board.findIndex(n => n.number !== boardNumber);
     if (numberIndex === -1) {
       throw new Error('Número de tablero inválido.');
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "05",
+   "00",

[Killed] ConditionalExpression
classes.ts:96:9
     }
 
     const numberIndex = this.board.findIndex(n => n.number === boardNumber);
-    if (numberIndex === -1) {
+    if (false) {
       throw new Error('Número de tablero inválido.');
     }
killedBy: Tablero debe lanzar un error al reservar un número de tablero inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número de tablero inválido."
Received message:   "Cannot read properties of undefined (reading 'isOccupied')"

      223 |         }
      224 |       }
    > 225 |       if (stryMutAct_9fa48("70") ? false : stryMutAct_9fa48("69") ? true : (stryCov_9fa48("69", "70"), this.board[numberIndex].isOccupied)) {

[Killed] EqualityOperator
classes.ts:96:9
     }
 
     const numberIndex = this.board.findIndex(n => n.number === boardNumber);
-    if (numberIndex === -1) {
+    if (numberIndex !== -1) {
       throw new Error('Número de tablero inválido.');
     }
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: Número de tablero inválido.

[Killed] BlockStatement
classes.ts:100:45
       throw new Error('Número de tablero inválido.');
     }
 
-    if (this.board[numberIndex].isOccupied) {
-      throw new Error(`El número ${boardNumber} ya está ocupado.`);
-    }
+    if (this.board[numberIndex].isOccupied) {}
 
     this.board[numberIndex].isOccupied = true;
killedBy: Tablero debe lanzar un error al reservar un número ocupado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El número 05 ya está ocupado."

Received function did not throw

[Killed] ConditionalExpression
classes.ts:100:9
       throw new Error('Número de tablero inválido.');
     }
 
-    if (this.board[numberIndex].isOccupied) {
+    if (false) {
       throw new Error(`El número ${boardNumber} ya está ocupado.`);
     }
killedBy: Tablero debe lanzar un error al reservar un número ocupado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El número 05 ya está ocupado."

Received function did not throw

[Killed] BooleanLiteral
classes.ts:104:42
       throw new Error(`El número ${boardNumber} ya está ocupado.`);
     }
 
-    this.board[numberIndex].isOccupied = true;
+    this.board[numberIndex].isOccupied = false;
     this.board[numberIndex].participantId = participantId;
   }
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
classes.ts:108:41
     this.board[numberIndex].participantId = participantId;
   }
 
-  freeNumber(boardNumber: string): void {
-    const numberIndex = this.board.findIndex(n => n.number === boardNumber);
-    if (numberIndex === -1) {
-      throw new Error('Número de tablero inválido.');
-    }
-
-    if (!this.board[numberIndex].isOccupied) {
-      throw new Error(`El número ${boardNumber} no está ocupado.`);
-    }
-
-    this.board[numberIndex].isOccupied = false;
-    this.board[numberIndex].participantId = null;
-  }
+  freeNumber(boardNumber: string): void {}
 
   getBoardStatus(): BoardNumber[] {
killedBy: Tablero debe liberar un número ocupado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
classes.ts:109:51
   }
 
   freeNumber(boardNumber: string): void {
-    const numberIndex = this.board.findIndex(n => n.number === boardNumber);
+    const numberIndex = this.board.findIndex(n => n.number !== boardNumber);
     if (numberIndex === -1) {
       throw new Error('Número de tablero inválido.');
killedBy: Tablero debe liberar un número ocupado
statusReason: Error: El número 05 no está ocupado.

[Killed] ConditionalExpression
classes.ts:109:51
   }
 
   freeNumber(boardNumber: string): void {
-    const numberIndex = this.board.findIndex(n => n.number === boardNumber);
+    const numberIndex = this.board.findIndex(n => false);
     if (numberIndex === -1) {
       throw new Error('Número de tablero inválido.');
killedBy: Tablero debe liberar un número ocupado
statusReason: Error: Número de tablero inválido.

[Killed] BlockStatement
classes.ts:110:29
 
   freeNumber(boardNumber: string): void {
     const numberIndex = this.board.findIndex(n => n.number === boardNumber);
-    if (numberIndex === -1) {
-      throw new Error('Número de tablero inválido.');
-    }
+    if (numberIndex === -1) {}
 
     if (!this.board[numberIndex].isOccupied) {
killedBy: Tablero debe lanzar un error al liberar un número de tablero inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número de tablero inválido."
Received message:   "Cannot read properties of undefined (reading 'isOccupied')"

      249 |         }
      250 |       }
    > 251 |       if (stryMutAct_9fa48("87") ? false : stryMutAct_9fa48("86") ? true : stryMutAct_9fa48("85") ? this.board[numberIndex].isOccupied : (stryCov_9fa48("85", "86", "87"),

[Killed] StringLiteral
classes.ts:111:23
   freeNumber(boardNumber: string): void {
     const numberIndex = this.board.findIndex(n => n.number === boardNumber);
     if (numberIndex === -1) {
-      throw new Error('Número de tablero inválido.');
+      throw new Error("");
     }
 
killedBy: Tablero debe lanzar un error al liberar un número de tablero inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número de tablero inválido."
Received message:   ""

      246 |         } else {
      247 |           stryCov_9fa48("83");
    > 248 |           throw new Error(stryMutAct_9fa48("84") ? "" : (stryCov_9fa48("84"), 'Número de tablero inválido.'));

[Killed] BlockStatement
classes.ts:114:46
       throw new Error('Número de tablero inválido.');
     }
 
-    if (!this.board[numberIndex].isOccupied) {
-      throw new Error(`El número ${boardNumber} no está ocupado.`);
-    }
+    if (!this.board[numberIndex].isOccupied) {}
 
     this.board[numberIndex].isOccupied = false;
killedBy: Tablero debe lanzar un error al liberar un número no ocupado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El número 05 no está ocupado."

Received function did not throw

[Killed] BooleanLiteral
classes.ts:114:9
       throw new Error('Número de tablero inválido.');
     }
 
-    if (!this.board[numberIndex].isOccupied) {
+    if (this.board[numberIndex].isOccupied) {
       throw new Error(`El número ${boardNumber} no está ocupado.`);
     }
killedBy: Tablero debe liberar un número ocupado
statusReason: Error: El número 05 no está ocupado.

[Killed] StringLiteral
classes.ts:115:23
     }
 
     if (!this.board[numberIndex].isOccupied) {
-      throw new Error(`El número ${boardNumber} no está ocupado.`);
+      throw new Error(``);
     }
 
killedBy: Tablero debe lanzar un error al liberar un número no ocupado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El número 05 no está ocupado."
Received message:   ""

      254 |         } else {
      255 |           stryCov_9fa48("88");
    > 256 |           throw new Error(stryMutAct_9fa48("89") ? `` : (stryCov_9fa48("89"), `El número ${boardNumber} no está ocupado.`));

[Killed] BooleanLiteral
classes.ts:118:42
       throw new Error(`El número ${boardNumber} no está ocupado.`);
     }
 
-    this.board[numberIndex].isOccupied = false;
+    this.board[numberIndex].isOccupied = true;
     this.board[numberIndex].participantId = null;
   }
killedBy: Tablero debe liberar un número ocupado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArrayDeclaration
classes.ts:123:12
   }
 
   getBoardStatus(): BoardNumber[] {
-    return [...this.board];
+    return [];
   }
 
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ArrowFunction
classes.ts:127:30
   }
 
   getOccupiedNumbersCount(): number {
-    return this.board.filter(n => n.isOccupied).length;
+    return this.board.filter(() => undefined).length;
   }
 
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
classes.ts:127:12
   }
 
   getOccupiedNumbersCount(): number {
-    return this.board.filter(n => n.isOccupied).length;
+    return this.board.length;
   }
 
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] ArrowFunction
classes.ts:131:30
   }
 
   getFreeNumbersCount(): number {
-    return this.board.filter(n => !n.isOccupied).length;
+    return this.board.filter(() => undefined).length;
   }
 
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] BooleanLiteral
classes.ts:131:35
   }
 
   getFreeNumbersCount(): number {
-    return this.board.filter(n => !n.isOccupied).length;
+    return this.board.filter(n => n.isOccupied).length;
   }
 
killedBy: Tablero debe inicializar un tablero con 100 números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] MethodExpression
classes.ts:135:12
   }
 
   getParticipantNumbers(participantId: string): string[] {
-    return this.board
-      .filter(n => n.participantId === participantId)
+    return this.board
       .map(n => n.number);
   }
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 99

  Array [
+   "00",
+   "01",

[Killed] ConditionalExpression
classes.ts:136:20
 
   getParticipantNumbers(participantId: string): string[] {
     return this.board
-      .filter(n => n.participantId === participantId)
+      .filter(n => true)
       .map(n => n.number);
   }
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 99

  Array [
+   "00",
+   "01",

[Killed] ArrowFunction
classes.ts:136:15
 
   getParticipantNumbers(participantId: string): string[] {
     return this.board
-      .filter(n => n.participantId === participantId)
+      .filter(() => undefined)
       .map(n => n.number);
   }
killedBy: Tablero debe reservar un número para un participante
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "05",
- ]

[Killed] ArrowFunction
classes.ts:141:46
   }
 
   getWinner(winningNumber: string): IParticipant | null {
-    const numberIndex = this.board.findIndex(n => n.number === winningNumber);
+    const numberIndex = this.board.findIndex(() => undefined);
     if (numberIndex === -1) {
       throw new Error('Número de tablero ganador inválido.');
killedBy: Tablero debe obtener el ganador
statusReason: Error: Número de tablero ganador inválido.

[Killed] ConditionalExpression
classes.ts:141:51
   }
 
   getWinner(winningNumber: string): IParticipant | null {
-    const numberIndex = this.board.findIndex(n => n.number === winningNumber);
+    const numberIndex = this.board.findIndex(n => false);
     if (numberIndex === -1) {
       throw new Error('Número de tablero ganador inválido.');
killedBy: Tablero debe obtener el ganador
statusReason: Error: Número de tablero ganador inválido.

[Killed] EqualityOperator
classes.ts:142:9
 
   getWinner(winningNumber: string): IParticipant | null {
     const numberIndex = this.board.findIndex(n => n.number === winningNumber);
-    if (numberIndex === -1) {
+    if (numberIndex !== -1) {
       throw new Error('Número de tablero ganador inválido.');
     }
killedBy: Tablero debe obtener el ganador
statusReason: Error: Número de tablero ganador inválido.

[Killed] ConditionalExpression
classes.ts:142:9
 
   getWinner(winningNumber: string): IParticipant | null {
     const numberIndex = this.board.findIndex(n => n.number === winningNumber);
-    if (numberIndex === -1) {
+    if (false) {
       throw new Error('Número de tablero ganador inválido.');
     }
killedBy: Tablero debe lanzar un error al obtener el ganador con un número de tablero inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número de tablero ganador inválido."
Received message:   "Cannot read properties of undefined (reading 'isOccupied')"

      308 |       }
      309 |       const winningBoardNumber = this.board[numberIndex];
    > 310 |       if (stryMutAct_9fa48("120") ? winningBoardNumber.isOccupied || winningBoardNumber.participantId : stryMutAct_

[Killed] StringLiteral
classes.ts:143:23
   getWinner(winningNumber: string): IParticipant | null {
     const numberIndex = this.board.findIndex(n => n.number === winningNumber);
     if (numberIndex === -1) {
-      throw new Error('Número de tablero ganador inválido.');
+      throw new Error("");
     }
 
killedBy: Tablero debe lanzar un error al obtener el ganador con un número de tablero inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número de tablero ganador inválido."
Received message:   ""

      304 |         } else {
      305 |           stryCov_9fa48("116");
    > 306 |           throw new Error(stryMutAct_9fa48("117") ? "" : (stryCov_9fa48("117"), 'Número de tablero ganador inválido.'));

[Killed] BlockStatement
classes.ts:147:76
     }
 
     const winningBoardNumber = this.board[numberIndex];
-    if (winningBoardNumber.isOccupied && winningBoardNumber.participantId) {
-      return this.participants.get(winningBoardNumber.participantId) || null;
-    }
+    if (winningBoardNumber.isOccupied && winningBoardNumber.participantId) {}
     return null;
   }
killedBy: Tablero debe obtener el ganador
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "jane.doe@example.com", "id": "1", "name": "Jane Doe", "phone": undefined}
Received: null
